Revit 2027 API
StructuralSectionIWelded.BottomFlangeThickness Property
 Bottom Flange Thickness.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BottomFlangeThickness { get; set; }
Public Property BottomFlangeThickness As Double
	Get
	Set
public:
property double BottomFlangeThickness {
	double get ();
	void set (double value);
}
member BottomFlangeThickness : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionIWelded Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace